cpp/cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ACM C++ Guide</title>
<!-- 2016-06-10 Fri 15:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Matt Hancock" />
<link rel="stylesheet" type="text/css" href="./css/main.css">
</head>
<body>
<div id="content">
<h1 class="title">ACM C++ Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. A little about the language</a></li>
<li><a href="#sec-1-2">1.2. Additional references</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Getting started</a>
<ul>
<li><a href="#sec-2-1">2.1. Text editors</a></li>
<li><a href="#sec-2-2">2.2. Compilers</a></li>
<li><a href="#sec-2-3">2.3. Writing a program</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. Deconstruction of the "Hello, world!" program</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="main">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Welcome to the ACM C++ guide, a guide to quickly learning C++
for mathematical and scientific computing applications. The goal of this
guide is not to make you a C++ expert, but to quickly teach you enough
of the C++ fundamentals and design patterns to help you off the ground.
If you should like to go beyond this guide, a few references are listed
below.
</p>

<p>
This guide is split into sections. The sections are ordered in such a way
that topics in later sections often depend on topics from previous ones. 
You'll find code snippets peppered throughout the sections.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> A little about the language</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Before you dive in, here is a little about the C++ programming language:
</p>

<p>
C++ is an extension of the C programming language. Both C and C++ are 
<b>statically-typed</b> and <b>compiled</b> languages, which means that the <b>type</b> 
of variables used in your source code must declared explicitly and is 
checked at when the program is compiled (i.e., translated into a machine 
executable file).
</p>

<p>
One (among many) difference between C++ and C, however, is that C++ provides 
many data structures for the object-oriented programming paradigm. This 
essentially allows the software writer (that's you) to create custom, complex, 
reusable data structures. The object-oriented paradigm is extremely useful, 
but we will only touch the surface of it in this guide.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Additional references</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://www.cplusplus.com/doc/tutorial">C++ tutorials</a>
</li>
<li><a href="https://en.wikipedia.org/wiki/C++">C++ wiki</a>
</li>
<li><a href="http://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">A compiled list of C++ textbooks from stackoverflow</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting started</h2>
<div class="outline-text-2" id="text-2">
<p>
The particular programming tools that you choose to use will
likely be largely influenced by the operating system that you use.
We will use free tools (often developed for GNU / Linux systems) in
this guide. These tools are mostly available in other (non UNIX-like)
operating systems as well. For example, on Windows, you could use
<a href="https://www.cygwin.com/">Cygwin</a>, or install a dual boot with some Linux distribution 
(e.g., <a href="http://www.ubuntu.com/">Ubuntu</a>a). On the other hand, MAC OSX, being a BSD-derived system, 
has many of the required tools already available (although, a command 
line utility, <a href="http://brew.sh">Brew</a>, makes building and installing other tools quite simple).
</p>

<p>
In the following two sections, we'll talk about the two basic types of 
software that you'll need to begin writing C++ programs.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Text editors</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The text editor that you choose to use should be be any program 
capable of editing plain text files. However, you may find that it's 
more productive to write in an editor who offers features such as 
syntax highlighting, code-completion, bracket-matching, or other features. 
Here are some popular free text editors:
</p>

<ul class="org-ul">
<li><a href="https://atom.io/">Atom</a> is a recently open-sourced GUI editor which some have compared to the very popular non-free editor, <a href="https://sublimetext.com">Sublime Text</a>.
</li>
<li><a href="https://wiki.gnome.org/Apps/Gedit">Gedit</a> is a nice and simple GUI editor, which is the default in GNOME desktop environment.
</li>
<li><a href="https://kate-editor.org">Kate</a> is a another simple GUI editor, which is the default in the KDE desktop environment.
</li>
<li><a href="https://www.gnu.org/software/emacs/">Emacs</a> is another powerful editor, which allows for highly optimized workflows.
</li>
<li><a href="http://www.vim.org">Vim</a> is a modal editor with a steep learning curve. It offers highly efficient means to edit text, and is available (or it's predecessor, vi) by default on nearly all UNIX-like operating systems.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Compilers</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Second, you'll need a program called a <b>compiler</b>. A compiler translates 
the high-level C++ language into an executable program. In this guide, we 
will use the <code>g++</code> compiler which is freely available through the 
<a href="https://gcc.gnu.org/">gnu compiler collection (gcc)</a>.
</p>

<p>
<code>g++</code> is a program which you typically call from the command line, which 
takes as input, your C++ source code file, and produces as output, a 
binary executable file.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Writing a program</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Let's create our first C++ program, the obligatory "Hello, world!". First, 
fire-up your text editor and create a file called, <code>hello.cpp</code>, with the 
following contents:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">1: </span>#include &lt;iostream&gt;
<span class="linenr">2: </span>
<span class="linenr">3: </span>int main() {
<span class="linenr">4: </span>  std::cout &lt;&lt; "Hello, world!";
<span class="linenr">5: </span>  return 0;
<span class="linenr">6: </span>}
</pre>
</div>

<p>
Now, to compile the program, execute:
</p>

<div class="org-src-container">

<pre class="src src-sh">g++ hello.cpp
</pre>
</div>

<p>
Followed by:
</p>
<pre class="example">
./a.out
</pre>

<p>
By default, <code>g++</code> calls the resulting binary executable, <code>a.out</code>, but
you can specify a different output file name by using the <code>-o</code> flag:
</p>

<pre class="example">
g++ hello.cpp -o my_executable_file.bin
</pre>

<p>
Note that in Windows, executable files typically end in <code>.exe</code>. In Unix-like
systems, there is no particular file-extension type for executables.
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Deconstruction of the "Hello, world!" program</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Let's look at this program line-by-line:
</p>

<ol class="org-ol">
<li>In line 1, we are including a library called <code>iostream</code>. A standard library (one that is included with C++) is usually included inside angular brackets. The <code>iostream</code> library is used for printing to the screen or prompting for user input.
</li>

<li>Line 2 is blank. Whitespace is ignored in C++.
</li>

<li>In line 3, we are declaring a function called <code>main</code> which has a return type of <code>int</code> (short for integer). Functions are followed by parentheses, listing their arguments (our <code>main</code> funcion has no arguments in this case), followed by the function body. The function body is enclosed by brackets. The function <code>main</code> is special - it is the main function (surprise) that is executed when you actually run your program.
</li>

<li>In line 4, we are giving the <code>Hello, world!</code> string to an object called <code>cout</code>, which prints the string. Note that <code>cout</code> is prefixed by <code>std</code>. The syntax, <code>std::cout</code>, means that <code>cout</code> belongs to the <b>namespace</b> called <code>std</code>. Namespaces are mechanisms for preventing name conflicts.
</li>

<li>In line 5, we return the value 0. This signifies to the program that called the executable <code>hello.cpp</code> program (the parent program, you could say) that our program exited successfully (i.e., without error).
</li>

<li>Line 6 closes the the the body of the function, <code>main</code>.
</li>
</ol>

</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
